{"pages":[{"url":"http://sb2gh.github.io/slg.html","text":"In this post we create a static blog using pelican and using the pelican theme 'Elegant' and host the blog on github user pages Environment set-up We first create a virtualenv that will contains all the necessary packages necessary for python pelican bm@Work ~/webbloggh - $ mkvirtualenv venv-pel bm@Work ~/webbloggh - $ source ~/.virtualenvs/venv-pel/bin/activate (venv-pel) bm@Work ~/webbloggh - $ pip install pelican, markdown, ghp-import, beautifulSoup4, cssmin, Pillow, cssprefixer, cssutils, pretty, six, smartypants, typogrify, webassets We need to install nodeenv so that we can install lessc that is required by webassets (venv-pel) bm@Work ~/webbloggh - $ pip install nodeenv (venv-pel) bm@Work ~/webbloggh - $ nodeenv --python-virtualenv (venv-pel) bm@Work ~/webbloggh - $ npm install less Create the blog with Pelican Now that all the necessary packages are installed, we can launch pelican to set up the static blog (venv-pel) bm@Work ~/webbloggh - $ pelican-quickstart We have to answer numerous questions to have pelican do the set-up. > Where do you want to create your new web site? [.] > What will be the title of this web site? blog depuzzled > Who will be the author of this web site? depuzzled > What will be the default language of this web site? [en] > Do you want to specify a URL prefix? e.g., http://example.com (Y/n) > What is your URL prefix? (see above example; no trailing slash) http://sb2gh.github.io > Do you want to enable article pagination? (Y/n) > How many articles per page do you want? [10] > What is your time zone? [Europe/Paris] US/Eastern > Do you want to generate a Fabfile/Makefile to automate generation and publishing? (Y/n) > Do you want an auto-reload & simpleHTTP script to assist with theme and site development? (Y/n) > Do you want to upload your website using FTP? (y/N) > Do you want to upload your website using SSH? (y/N) > Do you want to upload your website using Dropbox? (y/N) > Do you want to upload your website using S3? (y/N) > Do you want to upload your website using Rackspace Cloud Files? (y/N) > Do you want to upload your website using GitHub Pages? (y/N) y > Is this your personal page (username.github.io)? (y/N) y Done. Your new project is available at /Users/bm/webblog Here is the tree structure (brew tree; tree -L 1) ├── Makefile ├── content ├── develop_server.sh ├── fabfile.py ├── less.js ├── node_modules ├── output ├── pelican.pid ├── pelicanconf.py ├── pelicanconf.pyc ├── plugins ├── publishconf.py ├── publishconf.pyc ├── requirements.txt ├── srv.pid └── themes Adding Theme and Plugins We can choose the default theme of pelican or pick one that is available at http://www.pelicanthemes.com . In this post, we are using the theme named 'Elegant'. We need to download the theme that we want use and put it in a folder named 'themes' at the root of our blog. We are also going to add the different plugins that we want use such as the one for generating the table of content. We can get pelican plugins by cloning the following repo: https://github.com/getpelican/pelican-plugins.git . Once the theme and plugins are installed at the root of our blog, we need to edit the pelicanconf.py file to add the following information: 1 2 3 4 THEME = 'themes/elegant' MD_EXTENSIONS = [ 'codehilite(css_class=highlight)' , 'extra' , 'headerid' , 'toc(permalink=true)' ] PLUGIN_PATHS = [ 'plugins' , 'pelican-pluggins-master' ] PLUGINS = [ 'sitemap' , 'extract_toc' , 'tipue_search' , 'liquid_tags.img' , 'neighbors' , 'latex' , 'related_posts' , 'assets' , 'share_post' , 'multi_part' ] 1 2 def example (): print 'Hello World' We can now generate the output directory and check out blog at: localhost:8000 (venv-pel) bm@Work ~/webbloggh - $ make devserver (venv-pel) bm@Work ~/webbloggh - $ . develop_server.sh stop","tags":"Pelican","title":"Creating a Static Blog with Pelican and hosting it on github user pages"}]}